


level_farm = {
    1: {"name": "скелет", "hp": 80, "damage": 10, "gold": 10, "exp": 7},

    2: {"name": "слизь", "hp": 93, "damage": 12, "gold": 12, "exp": 9},

    3: {"name": "гоблин", "hp": 105, "damage": 15, "gold": 15, "exp": 11},

    4: {"name": "летучая мышь", "hp": 125, "damage": 18, "gold": 18, "exp": 13},

    5: {"name": "Орк", "hp": 150, "damage": 22, "gold": 21, "exp": 15},

    6: {"name": "титан маленький", "hp": 160, "damage": 25, "gold": 25, "exp": 15},

    7: {"name": "разбойник", "hp": 175, "damage": 27, "gold": 30, "exp": 18},

    8: {"name": "самурай", "hp": 190, "damage": 30, "gold": 35, "exp": 22},

    9: {"name": "ниндзя ", "hp": 200, "damage": 33, "gold": 40, "exp": 30},

    10: {"name": "Ползучий клык", "hp": 235, "damage": 38, "gold": 44, "exp": 35},

    11: {"name": "Лесной скребун", "hp": 260, "damage": 43, "gold": 47, "exp": 37},

    12: {"name": "Теневой Крысолак", "hp": 275, "damage": 47, "gold": 50, "exp": 40},

    13: {"name": "Ядовитый Стрелок", "hp": 300, "damage": 50, "gold": 54, "exp": 43},

    14: {"name": "Пещерный Ворчун", "hp": 333, "damage": 54, "gold": 60, "exp": 47},

    15: {"name": "Костяной Шмыг", "hp": 350, "damage": 60, "gold": 66, "exp": 52},

    16: {"name": "Дикий Плевун", "hp": 375, "damage": 66, "gold": 70, "exp": 56},

    17: {"name": "Когтевой Прыгун", "hp": 400, "damage": 70, "gold": 75, "exp": 60},

    18: {"name": "Тряпичный фантом", "hp": 440, "damage": 77, "gold": 80, "exp": 66},

    19: {"name": "Скальный дробитель", "hp": 470, "damage": 85, "gold": 86, "exp": 70},

    20: {"name": " Босс - ⭐☆☆☆☆", "hp": 600, "damage": 100, "gold": 95, "exp": 80},

    21: {"name": "Сырой Могильник", "hp": 630, "damage": 107, "gold": 100, "exp": 84},

    22: {"name": "Гнилозуб", "hp": 666, "damage": 113, "gold": 107, "exp": 90},

    23: {"name": "Песчаный Дух", "hp": 700, "damage": 125, "gold": 115, "exp": 100},

    24: {"name": "Мутный Страж", "hp": 750, "damage": 135, "gold": 122, "exp": 104},

    25: {"name": "Камнелоб", "hp": 815, "damage": 144, "gold": 133, "exp": 110},

    26: {"name": "Гнилой страж", "hp": 866, "damage": 155, "gold": 140, "exp": 117},

    27: {"name": "Чернильный Ползун", "hp": 900, "damage": 165, "gold": 150, "exp": 125},

    28: {"name": "Пыльный Каратель", "hp": 1000, "damage": 180, "gold": 166, "exp": 135},

    29: {"name": "Клинковый призрак", "hp": 1066, "damage": 190, "gold": 175, "exp": 144},

    30: {"name": "Ночной разоритель", "hp": 1450, "damage": 250, "gold": 215, "exp": 166},

    31: {"name": "Туманник", "hp": 1540, "damage": 262, "gold": 222, "exp": 175},

    32: {"name": "Шрамоносец", "hp": 1700, "damage": 275, "gold": 230, "exp": 184},

    33: {"name": "Ржавый Берсерк", "hp": 1790, "damage": 282, "gold": 244, "exp": 192},

    34: {"name": "Костеглот", "hp": 1860, "damage": 290, "gold": 250, "exp": 200},

    35: {"name": "Лютый Шипонос", "hp": 2050, "damage": 310, "gold": 260, "exp": 211},

    36: {"name": "Хребтолом", "hp": 2165, "damage": 325, "gold": 280, "exp": 220},

    37: {"name": "Мракохват", "hp": 2250, "damage": 344, "gold": 300, "exp": 235},

    38: {"name": "Грозовой Клекотун", "hp": 2400, "damage": 363, "gold": 315, "exp": 244},

    39: {"name": "Пепельный Воитель", "hp": 2500, "damage": 370, "gold": 325, "exp": 255},

    40: {"name": " Босс - ⭐⭐☆☆☆", "hp": 3000, "damage": 400, "gold": 360, "exp": 290},

    41: {"name": "Черепный Рыцарь", "hp": 3080, "damage": 410, "gold": 370, "exp": 300},

    42: {"name": "Скалодроб", "hp": 3150, "damage": 425, "gold": 385, "exp": 312},

    43: {"name": "Могильный Дозорный", "hp": 3240, "damage": 440, "gold": 400, "exp": 324},

    44: {"name": "Ледяной Скиталец", "hp": 3350, "damage": 460, "gold": 415, "exp": 333},

    45: {"name": "Кровопийца Топей", "hp": 3444, "damage": 470, "gold": 425, "exp": 340},

    46: {"name": "Песчаный Мучитель", "hp": 3600, "damage": 483, "gold": 444, "exp": 357},

    47: {"name": "Гнилокров", "hp": 3680, "damage": 490, "gold": 460, "exp": 366},

    48: {"name": "Каменный Жнец", "hp": 3750, "damage": 510, "gold": 475, "exp": 375},

    49: {"name": "Тенелом", "hp": 3900, "damage": 525, "gold": 490, "exp": 390},

    50: {"name": "Багровый Осквернитель", "hp": 4444, "damage": 555, "gold": 530, "exp": 415},

    51: {"name": "Громовой Палач", "hp": 4500, "damage": 562, "gold": 540, "exp": 423},

    52: {"name": "Черноплащ", "hp": 4666, "damage": 575, "gold": 560, "exp": 444},

    53: {"name": "Страж пустоты", "hp": 4750, "damage": 590, "gold": 575, "exp": 460},

    54: {"name": "Бездонный Скиталец", "hp": 4880, "damage": 625, "gold": 590, "exp": 475},

    55: {"name": "Яростный Крушитель", "hp": 5100, "damage": 644, "gold": 600, "exp": 485},

    56: {"name": "Пепельный Инквизатор", "hp": 5300, "damage": 666, "gold": 615, "exp": 500},

    57: {"name": "Лютокрыл", "hp": 5450, "damage": 680, "gold": 633, "exp": 515},

    58: {"name": "Раздиратель душ", "hp": 5666, "damage": 700, "gold": 650, "exp": 535},

    59: {"name": "Стальной призрак", "hp": 5850, "damage": 725, "gold": 666, "exp": 555},

    60: {"name": " Босс - ⭐⭐⭐☆☆", "hp": 6666, "damage": 777, "gold": 725, "exp": 600},

    61: {"name": " Мракожнец ", "hp": 6400, "damage": 760, "gold": 740, "exp": 610},

    62: {"name": "Лорд Гниения", "hp": 6550, "damage": 777, "gold": 750, "exp": 620},

    63: {"name": "Скверноносец", "hp": 6700, "damage": 790, "gold": 766, "exp": 635},

    64: {"name": "Пустнный Диктатор", "hp": 6800, "damage": 800, "gold": 780, "exp": 650},

    65: {"name": "Каратель Бездны", "hp": 6900, "damage": 815, "gold": 800, "exp": 655},

    66: {"name": "Древний разрушитель", "hp": 7000, "damage": 830, "gold": 825, "exp": 666},

    67: {"name": "Грозокост", "hp": 7060, "damage": 837, "gold": 840, "exp": 670},

    68: {"name": "Поглотитель плоти", "hp": 7130, "damage": 843, "gold": 850, "exp": 675},

    69: {"name": "Титан Пепла", "hp": 7200, "damage": 850, "gold": 866, "exp": 690},

    70: {"name": "Князь Разлома", "hp": 7000, "damage": 1000, "gold": 900, "exp": 720},

    71: {"name": "Владыка Туманов", "hp": 7400, "damage": 930, "gold": 907, "exp": 725},

    72: {"name": "Архижнец", "hp": 7550, "damage": 960, "gold": 915, "exp": 733},

    73: {"name": "Повелитель Костей", "hp": 7800, "damage": 1030, "gold": 944, "exp": 755},

    74: {"name": "Мракосуд", "hp": 8000, "damage": 1055, "gold": 966, "exp": 770},

    75: {"name": "Колосс Скверны", "hp": 8100, "damage": 1070, "gold": 980, "exp": 782},

    76: {"name": "Бич небес ", "hp": 8240, "damage": 1100, "gold": 1000, "exp": 800},

    77: {"name": "Пожиратель эха", "hp": 8330, "damage": 1125, "gold": 1030, "exp": 830},

    78: {"name": "Верховный осквернитель", "hp": 8444, "damage": 1140, "gold": 1060, "exp": 845},

    79: {"name": "Король Шрамов", "hp": 8625, "damage": 1160, "gold": 1100, "exp": 866},

    80: {"name": " Босс - ⭐⭐⭐⭐☆", "hp": 9000, "damage": 1200, "gold": 1200, "exp": 910},

    81: {"name": "Вестник конца", "hp": 9200, "damage": 1250, "gold": 1225, "exp": 930},

    82: {"name": "Архонт Пустоты", "hp": 9300, "damage": 1275, "gold": 1250, "exp": 950},

    83: {"name": "Лорд Катастроф", "hp": 9400, "damage": 1300, "gold": 1275, "exp": 970},

    84: {"name": "Предвестник Погибели", "hp": 9500, "damage": 1325, "gold": 1300, "exp": 985},

    85: {"name": "Крушитель Багровых небес", "hp": 9570, "damage": 1340, "gold": 1325, "exp": 1000},

    86: {"name": "Деспот Разлома", "hp": 9650, "damage": 1360, "gold": 1350, "exp": 1025},

    87: {"name": "Архигубитель", "hp": 9725, "damage": 1380, "gold": 1375, "exp": 1050},

    88: {"name": "Варлок Пепельной Бури", "hp": 9800, "damage": 1400, "gold": 1400, "exp": 1075},

    89: {"name": "Черноклык Тиран", "hp": 9999, "damage": 1440, "gold": 1450, "exp": 1111},

    90: {"name": "Палач Тысячи душ", "hp": 10800, "damage": 1555, "gold": 1525, "exp": 1160},

    91: {"name": "Молот преисподней", "hp": 10900, "damage": 1600, "gold": 1570, "exp": 1200},

    92: {"name": "Лорд Кровавого Знамения", "hp": 11111, "damage": 1666, "gold": 1625, "exp": 1240},

    93: {"name": "Громовержец Скверны", "hp": 11300, "damage": 1700, "gold": 1700, "exp": 1275},

    94: {"name": "Теневой Император", "hp": 11700, "damage": 1740, "gold": 1800, "exp": 1330},

    95: {"name": "Колосс Пустоты ", "hp": 12100, "damage": 1800, "gold": 1900, "exp": 1400},

    96: {"name": "Жнец Забвения", "hp": 12600, "damage": 1900, "gold": 2000, "exp": 1460},

    97: {"name": "Верховный Суд", "hp": 13300, "damage": 1950, "gold": 2100, "exp": 1520},

    98: {"name": "Пожиратель судеб", "hp": 14500, "damage": 2015, "gold": 2250, "exp": 1600},

    99: {"name": "Каратель Последего Часа", "hp": 15400, "damage": 2040, "gold": 2430, "exp": 1700},

    100: {"name": " Босс - ⭐⭐⭐⭐⭐", "hp": 17000, "damage": 2200, "gold": 2700, "exp": 1900},

    101: {"name": " Девочка - Элирия ", "hp": 22000, "damage": 2666, "gold": 5000, "exp": 2300}
    
    }